{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 250, 250, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["acc"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of121.bin", "group1-shard2of121.bin", "group1-shard3of121.bin", "group1-shard4of121.bin", "group1-shard5of121.bin", "group1-shard6of121.bin", "group1-shard7of121.bin", "group1-shard8of121.bin", "group1-shard9of121.bin", "group1-shard10of121.bin", "group1-shard11of121.bin", "group1-shard12of121.bin", "group1-shard13of121.bin", "group1-shard14of121.bin", "group1-shard15of121.bin", "group1-shard16of121.bin", "group1-shard17of121.bin", "group1-shard18of121.bin", "group1-shard19of121.bin", "group1-shard20of121.bin", "group1-shard21of121.bin", "group1-shard22of121.bin", "group1-shard23of121.bin", "group1-shard24of121.bin", "group1-shard25of121.bin", "group1-shard26of121.bin", "group1-shard27of121.bin", "group1-shard28of121.bin", "group1-shard29of121.bin", "group1-shard30of121.bin", "group1-shard31of121.bin", "group1-shard32of121.bin", "group1-shard33of121.bin", "group1-shard34of121.bin", "group1-shard35of121.bin", "group1-shard36of121.bin", "group1-shard37of121.bin", "group1-shard38of121.bin", "group1-shard39of121.bin", "group1-shard40of121.bin", "group1-shard41of121.bin", "group1-shard42of121.bin", "group1-shard43of121.bin", "group1-shard44of121.bin", "group1-shard45of121.bin", "group1-shard46of121.bin", "group1-shard47of121.bin", "group1-shard48of121.bin", "group1-shard49of121.bin", "group1-shard50of121.bin", "group1-shard51of121.bin", "group1-shard52of121.bin", "group1-shard53of121.bin", "group1-shard54of121.bin", "group1-shard55of121.bin", "group1-shard56of121.bin", "group1-shard57of121.bin", "group1-shard58of121.bin", "group1-shard59of121.bin", "group1-shard60of121.bin", "group1-shard61of121.bin", "group1-shard62of121.bin", "group1-shard63of121.bin", "group1-shard64of121.bin", "group1-shard65of121.bin", "group1-shard66of121.bin", "group1-shard67of121.bin", "group1-shard68of121.bin", "group1-shard69of121.bin", "group1-shard70of121.bin", "group1-shard71of121.bin", "group1-shard72of121.bin", "group1-shard73of121.bin", "group1-shard74of121.bin", "group1-shard75of121.bin", "group1-shard76of121.bin", "group1-shard77of121.bin", "group1-shard78of121.bin", "group1-shard79of121.bin", "group1-shard80of121.bin", "group1-shard81of121.bin", "group1-shard82of121.bin", "group1-shard83of121.bin", "group1-shard84of121.bin", "group1-shard85of121.bin", "group1-shard86of121.bin", "group1-shard87of121.bin", "group1-shard88of121.bin", "group1-shard89of121.bin", "group1-shard90of121.bin", "group1-shard91of121.bin", "group1-shard92of121.bin", "group1-shard93of121.bin", "group1-shard94of121.bin", "group1-shard95of121.bin", "group1-shard96of121.bin", "group1-shard97of121.bin", "group1-shard98of121.bin", "group1-shard99of121.bin", "group1-shard100of121.bin", "group1-shard101of121.bin", "group1-shard102of121.bin", "group1-shard103of121.bin", "group1-shard104of121.bin", "group1-shard105of121.bin", "group1-shard106of121.bin", "group1-shard107of121.bin", "group1-shard108of121.bin", "group1-shard109of121.bin", "group1-shard110of121.bin", "group1-shard111of121.bin", "group1-shard112of121.bin", "group1-shard113of121.bin", "group1-shard114of121.bin", "group1-shard115of121.bin", "group1-shard116of121.bin", "group1-shard117of121.bin", "group1-shard118of121.bin", "group1-shard119of121.bin", "group1-shard120of121.bin", "group1-shard121of121.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [984064, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}]}]}